Конфигурация/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенИнтерактивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВариантов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗапуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВызоваДополнительныхОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьОповещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗаданиеGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПараметров</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Скриншоты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДополнительныеОтчетыИОбработки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ВывестиСтрокуВДокумент(ТабличныйДокумент, СтрокаДанных, ВывестиСВыделением = Ложь)
	
	НомерКолонки = 0;
	НомерСтроки = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Для Каждого ЭлементСтроки Из СтрокаДанных Цикл 
		НомерКолонки = НомерКолонки + 1;
		ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст = ?(ТипЗнч(ЭлементСтроки) = Тип("КлючИЗначение"), ЭлементСтроки.Значение, ЭлементСтроки);
		Если ВывестиСВыделением Тогда
			ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Шрифт = Новый Шрифт(ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Шрифт,,, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВерсииДополнительныхОбработокКонфигурации()
	
	// Получаем таблицу версий доп.обработок
	ВерсииДополнительныхОбработок = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьВерсииДополнительныхОбработокМД();
	
	// Выводим ее в табличный документ
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ВывестиСтрокуВДокумент(ТабличныйДокумент, Новый Структура("ИмяОбъекта,Вид,Наименование,Информация,Версия,ДоступенИнтерактивно", "Имя объекта", "Вид", "Наименование", "Информация", "Версия", "Доступен интерактивно"), Истина); 	
	Для Каждого ОписаниеДопОбработки Из ВерсииДополнительныхОбработок Цикл
		ВывестиСтрокуВДокумент(ТабличныйДокумент, ОписаниеДопОбработки); 			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяПользователяИБ(Пользователь)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);
	
	Возврат ПользовательИБ.Имя;
	
КонецФункции // ПолучитьИмяПользователяИБ

&НаСервереБезКонтекста
Функция ПолучитьРезультатСравнения(АдресДокумента, РасширениеФайла)
	
	// Получаем таблицу версий доп.обработок конфигурации
	ИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДокумента);
	ДвоичныеДанные.Записать(ИмяФайла);
	УдалитьИзВременногоХранилища(АдресДокумента);
	
	ЗагруженныйДокумент = Новый ТабличныйДокумент;
	ЗагруженныйДокумент.Прочитать(ИмяФайла);
	УдалитьФайлы(ИмяФайла);

	ВерсииДополнительныхОбработок = Новый ТаблицаЗначений;
	ВерсииДополнительныхОбработок.Колонки.Добавить("ИмяОбъекта", Новый ОписаниеТипов("Строка"));
	ВерсииДополнительныхОбработок.Колонки.Добавить("Вид", Новый ОписаниеТипов("Строка"));
	ВерсииДополнительныхОбработок.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ВерсииДополнительныхОбработок.Колонки.Добавить("Информация", Новый ОписаниеТипов("Строка"));
	ВерсииДополнительныхОбработок.Колонки.Добавить("Версия", Новый ОписаниеТипов("Строка"));
	ВерсииДополнительныхОбработок.Колонки.Добавить("ДоступенИнтерактивно", Новый ОписаниеТипов("Строка"));
	
	Для НомСтр = 2 По ЗагруженныйДокумент.ВысотаТаблицы Цикл
		ОписаниеОбработки = ВерсииДополнительныхОбработок.Добавить();
		ОписаниеОбработки.ИмяОбъекта			= ЗагруженныйДокумент.Область(НомСтр, 1).Текст;		
		ОписаниеОбработки.Вид					= ЗагруженныйДокумент.Область(НомСтр, 2).Текст;
		ОписаниеОбработки.Наименование			= ЗагруженныйДокумент.Область(НомСтр, 3).Текст;
		ОписаниеОбработки.Информация			= ЗагруженныйДокумент.Область(НомСтр, 4).Текст;
		ОписаниеОбработки.Версия				= ЗагруженныйДокумент.Область(НомСтр, 5).Текст;
		ОписаниеОбработки.ДоступенИнтерактивно	= ЗагруженныйДокумент.Область(НомСтр, 6).Текст;
	КонецЦикла;
	
	// Получаем таблицу версий доп. обработок БД
	ВерсииДополнительныхОбработокБД = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьВерсииДополнительныхОбработокИБ();
	
	// Формируем различия
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СтруктураРазличий = Новый Структура("Вид, Наименование, Информация, Версия, ДоступенИнтерактивно");
	
	ВывестиСтрокуВДокумент(ТабличныйДокумент, Новый Структура("ИмяОбъекта, Наименование, Ответственный, ОписаниеРазличий", "Имя объекта", "Наименование", "Ответственный", "Описание различий"), Истина); 	
	
	Для Каждого ОписаниеДопОбработки Из ВерсииДополнительныхОбработокБД Цикл
		
		ОписаниеРазличий = "";
		
		ОписаниеОбработкиКонфигурации = ВерсииДополнительныхОбработок.Найти(ОписаниеДопОбработки.ИмяОбъекта, "ИмяОбъекта");
		Если ОписаниеОбработкиКонфигурации = Неопределено Тогда
			ОписаниеРазличий = "Обработка не найдена";
		Иначе
			Для Каждого ОписаниеПараметра Из СтруктураРазличий Цикл
				Если ОписаниеДопОбработки[ОписаниеПараметра.Ключ] <> ОписаниеОбработкиКонфигурации[ОписаниеПараметра.Ключ] Тогда
					ОписаниеРазличий = ОписаниеРазличий + ?(ПустаяСтрока(ОписаниеРазличий), "", Символы.ПС) + ОписаниеПараметра.Ключ + ": " + ОписаниеДопОбработки[ОписаниеПараметра.Ключ] + " <> " + ОписаниеОбработкиКонфигурации[ОписаниеПараметра.Ключ];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеРазличий) Тогда
			ВывестиСтрокуВДокумент(
				ТабличныйДокумент,
				Новый Структура("ИмяОбъекта, Наименование, Ответственный, ОписаниеРазличий",
						ОписаниеДопОбработки.ИмяОбъекта,
						ОписаниеДопОбработки.Наименование,
						ПолучитьИмяПользователяИБ(ОписаниеДопОбработки.Ответственный),
						ОписаниеРазличий));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьТекущиеВерсииВКаталогНаСервере(ИмяКаталога)
	
	Обработано = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
		|	ДополнительныеОтчетыИОбработки.ИмяФайла КАК ИмяФайла,
		|	ДополнительныеОтчетыИОбработки.ХранилищеФайла КАК ХранилищеФайла,
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта КАК ИмяОбъекта,
		|	ВЫБОР
		|		КОГДА ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет)
		|			ТОГДА ""erf""
		|		КОГДА ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка)
		|			ТОГДА ""epf""
		|		ИНАЧЕ ""e""
		|	КОНЕЦ КАК РасширениеФайла
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвоичныеДанные = Выборка.ХранилищеФайла.Получить();
		ДвоичныеДанные.Записать(ИмяКаталога + ?(Прав(ИмяКаталога, 1) = "\", "", "\") + Выборка.ИмяОбъекта + "." + Выборка.РасширениеФайла);
		
		Обработано = Обработано + 1;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнение завершено. Сохранено файлов: " + Обработано);
	
КонецПроцедуры // ПолучитьМассивДопОтчетовИОбработок


&НаКлиенте
Процедура СохранитьВерсииОбработокМДВФайл(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла     = "Версии доп. обработок конфигурации";
		ДиалогСохраненияФайла.Фильтр             = НСтр("ru = 'Табличный документ (*.mxl)|*.mxl|Лист Excel (*.xls)|*.xls|Лист Excel2007... (*.xlsx)|*.xlsx'");
		ДиалогСохраненияФайла.ИндексФильтра      = 0;
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок          = НСтр("ru = 'Укажите файл'");
		
		Если ДиалогСохраненияФайла.Выбрать() Тогда
			ТипыДокумента = Новый Массив;
			ТипыДокумента.Добавить(ТипФайлаТабличногоДокумента.MXL);
			ТипыДокумента.Добавить(ТипФайлаТабличногоДокумента.XLS);
			ТипыДокумента.Добавить(ТипФайлаТабличногоДокумента.XLSX);
			
			ВерсииДополнительныхОбработок = ПолучитьВерсииДополнительныхОбработокКонфигурации();
			ВерсииДополнительныхОбработок.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла, ТипыДокумента[ДиалогСохраненияФайла.ИндексФильтра]);
			
			ПоказатьПредупреждение(, "Сохранение успешно завершено");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьВерсииОбработокИБСФайлом(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Фильтр             = НСтр("ru = 'Табличный документ (*.mxl)|*.mxl|Лист Excel (*.xls)|*.xls|Лист Excel2007... (*.xlsx)|*.xlsx'");
		ДиалогОткрытияФайла.ИндексФильтра      = 0;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок          = НСтр("ru = 'Выберите файл с выгрузкой версий дополнительных обработок'");
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			АдресДокумента = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла), ЭтаФорма.УникальныйИдентификатор);
			ОписаниеФайла = Новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);
			РасширениеФайла = ОписаниеФайла.Расширение; 
			
			РезультатСравнения = ПолучитьРезультатСравнения(АдресДокумента, ?(Лев(РасширениеФайла,1) = ".", Сред(РасширениеФайла, 2), РасширениеФайла));
			РезультатСравнения.Показать("Описание различий дополнительных обработок");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьТекущиеВерсииВКаталог(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;	
	
	ВыгрузитьТекущиеВерсииВКаталогНаСервере(ДиалогВыбора.Каталог);
	
КонецПроцедуры
